src/data/test-Mon Apr 19 2021 20:17:59 GMT-0500 (Central Daylight Time).xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Data xmlns="http://localhost:3000/">
        <Name>One Piece</Name>
        <Rating>9.5</Rating>
    </Data>
  </soap:Body>
</soap:Envelope>